In [6]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [9]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [10]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title    year      name   type                character     n
0        Closet Monster  2015.0  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985.0    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017.0   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015.0   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015.0   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [33]:
def decade(year):
    q = int(year//10)*10
    return q

titles['decade']=titles['year'].apply(decade)
titles[['title','decade']].groupby('decade').count()

        title
decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210

### Use groupby() count the number of "Hamlet" films made in each decade.

In [30]:
q=titles[titles['title'].str.contains("Hamlet")]
q[['title','decade']].groupby('decade').count()

        title
decade
1910        4
1920        2
1930        1
1940        1
1950        1
1960        3
1970        4
1980        3
1990        6
2000       13
2010       16

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [32]:
q= cast[cast["n"]==1]
q.groupby("type").count()

          title    year    name  character       n
type
actor    102199  102199  102199     102199  102199
actress   38631   38631   38631      38631   38631

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [42]:

q= cast[cast["year"].between(1950,1959)]
q=cast[cast['n'].between(1,5)]
q.groupby(["type",'n']).count()

              title    year    name  character
type    n
actor   1.0  102199  102199  102199     102199
        2.0   74901   74901   74901      74901
        3.0   82607   82607   82607      82607
        4.0   79699   79699   79699      79699
        5.0   78673   78673   78673      78673
actress 1.0   38631   38631   38631      38631
        2.0   54172   54172   54172      54172
        3.0   41670   41670   41670      41670
        4.0   38808   38808   38808      38808
        5.0   34178   34178   34178      34178

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [49]:

q = cast[cast["title"].str.contains("Pink Panther")]
q[['title','character']].groupby(['title']).count()

                                character
title
Curse of the Pink Panther              66
Revenge of the Pink Panther            60
Son of the Pink Panther                46
The Pink Panther                      106
The Pink Panther 2                     80
The Pink Panther Strikes Again         67
The Return of the Pink Panther         30
Trail of the Pink Panther              41

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [97]:
#year,#title, #name #character count>0

q = cast[cast["name"] == ("Frank Oz")]
f=q[['title','character']].groupby(['title']).count()
f
n=f['character']>1
f[n].sort_index()

                                      character
title
An American Werewolf in London                2
Follow That Bird                              3
Muppet Treasure Island                        4
Muppets from Space                            4
The Adventures of Elmo in Grouchland          3
The Dark Crystal                              2
The Great Muppet Caper                        6
The Muppet Christmas Carol                    7
The Muppet Movie                              8
The Muppets Take Manhattan                    7

### List each of the characters that Frank Oz has portrayed at least twice.

In [106]:
#year,#title, #name #character count>0

q = cast[cast["name"] == ("Frank Oz")]
f=q[['character','title']].groupby(['character']).count().reset_index()
f
n=f['title']>1
f[n].sort_index()

         character  title
0           Animal      6
2             Bert      3
5   Cookie Monster      3
10     Fozzie Bear      4
15          Grover      2
18      Miss Piggy      6
25   Sam the Eagle      5
34            Yoda      6